content/intro/content.md
---
title: "Εισαγωγή: Θεωρητικές Έννοιες"
author: ["IOANNIS ZANNOS"]
lastmod: 2018-12-19T20:16:25+02:00
draft: false
weight: 4
---

Εδώ είναι μια λίστα των εννοιών που σημειώθηκαν στο 3ο μάθημα.  Σχόλια για τις έννοιες αυτές θα συμπληρωθούν διαδοχικά κατά την εξέλιξη του εξαμήνου.


## Αντικειμενοστραφής Προγραμματισμός: Object Oriented Programming (OOP) {#αντικειμενοστραφής-προγραμματισμός-object-oriented-programming--oop}


## Types of programming styles (Paradigms) {#types-of-programming-styles--paradigms}

See: <https://www.geeksforgeeks.org/introduction-of-programming-paradigms/>

-   Imperative
-   Declarative

Some of the types below can be classified under _imperative_ or _declarative_:

-   Procedural
-   Logic
-   Object Oriented
-   Functional
-   Other (Subject oriented, aspect oriented, etc.)


## Basic concepts {#basic-concepts}


### Function {#function}


### Arguments {#arguments}


### Recursion {#recursion}


### Iteration {#iteration}


### Closure {#closure}


### Function callback {#function-callback}


### Asynchronous programming {#asynchronous-programming}


### Scheduling, multitasking, threads {#scheduling-multitasking-threads}


### Namespace {#namespace}


### OOP concepts {#oop-concepts}


#### Object {#object}


#### Method {#method}


#### Message {#message}


#### Class {#class}


#### Superclass, subclass, meta class {#superclass-subclass-meta-class}


#### Inheritance {#inheritance}


#### Polymorphism {#polymorphism}


#### Encapsulation {#encapsulation}


### Introspection - Reflexive programming {#introspection-reflexive-programming}


### Identifier {#identifier}


### Type / Datastructure {#type-datastructure}


### Variable {#variable}


### Directive (?) {#directive}


### Compiler {#compiler}


### Interpreter {#interpreter}


### Read-Eval-Print-Loop (REPL) {#read-eval-print-loop--repl}


### Sound related {#sound-related}


#### Signal {#signal}

-    Audio and Control rate signals


#### Buffer {#buffer}


#### Bus {#bus}


#### Unit generator {#unit-generator}


#### Synth Process {#synth-process}


### Music related / advanced {#music-related-advanced}


#### Stream and Pattern {#stream-and-pattern}


### GUI {#gui}


### Types of Intrerfaces {#types-of-intrerfaces}


## Some deeper fundamental concepts {#some-deeper-fundamental-concepts}


## Human based information approach {#human-based-information-approach}


### Signal {#signal}


### Sign {#sign}


### Signifier / Signified {#signifier-signified}


### Linguistics / Cognitive Science {#linguistics-cognitive-science}


### Semantics / Semotics {#semantics-semotics}


### Information ???? {#information}


### Language {#language}


## Non-Human based information approach {#non-human-based-information-approach}


### Data based {#data-based}


### Data science {#data-science}


### Big data {#big-data}


### Statistics {#statistics}


### Bayesian reasoning {#bayesian-reasoning}
